Tekla Open API Reference for Tekla Structures 2025
Assembly.HasUserDefinedCoordSys Method
 Returns whether the assembly has a user defined coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool HasUserDefinedCoordSys()
Public Function HasUserDefinedCoordSys As Boolean
Return Value
Type: Boolean
True if the assembly has a user defined coordinate system.
Remarks
Currently only supported with rebar assemblies.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace